# Assignment 1 - Task 2

In [28]:
"""It happens all the time: someone gives you data containing malformed strings, Python, lists and
missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})"""

import pandas as pd
import numpy as np

# DataFrame Details as loaded before replacing NAN

In [30]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

# Assignment 1

In [31]:
'''
1. Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).
'''

# replacing NAN values with the preceding values + 10 in FlightNumber Column
for i in range(df.FlightNumber.count() + 1):
    print(df.FlightNumber.loc[i,])
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10
        print(df.FlightNumber.loc[i,])

10045.0
nan
10055.0
10065.0
nan
10075.0

# DataFrame Details after replacing NAN values

In [32]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

# Assignment 2

In [33]:
'''
2. The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.
'''
df_tmp = df.copy()
df_tmp[['From','To']] = df_tmp.From_To.str.split("_",expand=True)

In [34]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [35]:
df_tmp

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",LoNDon,paris
1,<Air France> (12),10055.0,MAdrid_miLAN,[],MAdrid,miLAN
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
3,12. Air France,10075.0,Budapest_PaRis,[13],Budapest,PaRis
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,londOn

# Assignment 3

In [36]:
'''
3. Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London".)
'''
print(df_tmp)
df_tmp.From = df_tmp.From.str.capitalize()
df_tmp.To = df_tmp.To.str.capitalize()
df_tmp.From_To = df_tmp.From_To.str.capitalize()
print('-'*80)
print(df_tmp)

               Airline  FlightNumber           From_To  RecentDelays  \
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn
--------------------------------------------------------------------------------
               Airline  FlightNumber           From_To  RecentDelays  \
0               KLM(!)       10045.0      London_paris      [23, 47]
1    <Air France> (12)       10055.0      Madrid_milan            []
2  (British Airways. )       10065.0  London_stockholm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_paris          [13]
4          "Swiss Air"       10085.0   Brussels_london      [67, 32]

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Assignment 4

In [37]:
'''
4. Delete the From_To column from df and attach the temporary DataFrame from the
previous questions.
'''
print(df)
df.drop('From_To',axis=1,inplace=True)
print('-'*80)
print(df)
df['From_To'] = df_tmp['From_To']
print('-'*80)
print(df)

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]
--------------------------------------------------------------------------------
               Airline  FlightNumber  RecentDelays
0               KLM(!)       10045.0      [23, 47]
1    <Air France> (12)       10055.0            []
2  (British Airways. )       10065.0  [24, 43, 87]
3       12. Air France       10075.0          [13]
4          "Swiss Air"       10085.0      [67, 32]
--------------------------------------------------------------------------------
               Airline  FlightNumber  RecentDelays           From_To
0               KLM(!)       10045.0      [23, 47]      London_paris
1    <Air France> (12)       10055.0            []      Madrid_milan
2  (British Airways. )       10065.0  [24, 43, 87]  London_stockholm
3       12. Air France       10075.0          [13]    Budapest_paris
4          "Swiss Air"       10085.0      [67, 32]   Brussels_london

# Assignment 5

In [38]:
'''
5. In the RecentDelays column, the values have been entered into the DataFrame as a
list. We would like each first value in its own column, each second value in its own
column, and so on. If there isn't an Nth value, the value should be NaN.
'''
rows = []
_ = df.apply(lambda row: [rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) 
                         for nn in row.RecentDelays], axis=1)

In [39]:
rows

[['KLM(!)', 10045.0, 23, 'London_paris'],
 ['KLM(!)', 10045.0, 47, 'London_paris'],
 ['(British Airways. )', 10065.0, 24, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 43, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 87, 'London_stockholm'],
 ['12. Air France', 10075.0, 13, 'Budapest_paris'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_london'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_london']]

In [40]:
df_new = pd.DataFrame(rows, columns=df.columns)

In [41]:
print("Original DataFrame :  \n")
print(df)
print('*'*80)
print("New DataFrame :  \n")
print(df_new)

Original DataFrame :

               Airline  FlightNumber  RecentDelays           From_To
0               KLM(!)       10045.0      [23, 47]      London_paris
1    <Air France> (12)       10055.0            []      Madrid_milan
2  (British Airways. )       10065.0  [24, 43, 87]  London_stockholm
3       12. Air France       10075.0          [13]    Budapest_paris
4          "Swiss Air"       10085.0      [67, 32]   Brussels_london
********************************************************************************
New DataFrame :

               Airline  FlightNumber  RecentDelays           From_To
0               KLM(!)       10045.0            23      London_paris
1               KLM(!)       10045.0            47      London_paris
2  (British Airways. )       10065.0            24  London_stockholm
3  (British Airways. )       10065.0            43  London_stockholm
4  (British Airways. )       10065.0            87  London_stockholm
5       12. Air France       10075.0            13    Budapest_paris
6          "Swiss Air"       10085.0            67   Brussels_london
7          "Swiss Air"       10085.0            32   Brussels_london

In [42]:
'''

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,
delay_2, etc. and replace the unwanted RecentDelays column in df with delays.
'''
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())

In [43]:
 df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [44]:
length_cols = df3.shape[1]

In [45]:
length_cols

3

In [46]:
df3.columns[0]

0

In [47]:
col_list = []
col_dict ={}
for i in range(length_cols):
    Key = df3.columns[i]
    #print(key,i)
    Value = "Delay" + str(i+1)
    col_dict[Key] = Value

In [48]:
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [49]:
df3.rename(columns=col_dict,inplace=True)

In [50]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [51]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [52]:
print(df)
print('*'*80)
df.drop('RecentDelays',axis=1,inplace=True)
print(df)

               Airline  FlightNumber  RecentDelays           From_To  Delay1  \
0               KLM(!)       10045.0      [23, 47]      London_paris    23.0
1    <Air France> (12)       10055.0            []      Madrid_milan     NaN
2  (British Airways. )       10065.0  [24, 43, 87]  London_stockholm    24.0
3       12. Air France       10075.0          [13]    Budapest_paris    13.0
4          "Swiss Air"       10085.0      [67, 32]   Brussels_london    67.0

   Delay2  Delay3
0    47.0     NaN
1     NaN     NaN
2    43.0    87.0
3     NaN     NaN
4    32.0     NaN
********************************************************************************
               Airline  FlightNumber           From_To  Delay1  Delay2  Delay3
0               KLM(!)       10045.0      London_paris    23.0    47.0     NaN
1    <Air France> (12)       10055.0      Madrid_milan     NaN     NaN     NaN
2  (British Airways. )       10065.0  London_stockholm    24.0    43.0    87.0
3       12. Air France       10075.0    Budapest_paris    13.0     NaN     NaN
4          "Swiss Air"       10085.0   Brussels_london    67.0    32.0     NaN

In [53]:
#final changed df
df

               Airline  FlightNumber           From_To  Delay1  Delay2  Delay3
0               KLM(!)       10045.0      London_paris    23.0    47.0     NaN
1    <Air France> (12)       10055.0      Madrid_milan     NaN     NaN     NaN
2  (British Airways. )       10065.0  London_stockholm    24.0    43.0    87.0
3       12. Air France       10075.0    Budapest_paris    13.0     NaN     NaN
4          "Swiss Air"       10085.0   Brussels_london    67.0    32.0     NaN